tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
	<clients>
		<client host="localhost" use_controller_vm="true" />
	</clients>

	<servers>
		<server host="localhost" port="3000" type="tcp"></server>
	</servers>

	<monitoring>
		<monitor host="localhost" type="snmp"></monitor>
	</monitoring>

	<load>
		<arrivalphase phase="1" duration="2" unit="minute">
			<!-- maxnumber：最大用户数；arrivalrate：每秒新增用户数；unit：单位秒-->
			<users maxnumber="1000" arrivalrate="1" unit="minute"></users>
		</arrivalphase>
	</load>
	
	<options>
		<option name="thinktime" value="1" random="false" override="true"/>
	</options>
	
	<sessions>
		<session name="http-example" probability="100" type="ts_http">
			<request>
				<http url="/file" method="POST" version="1.1"></http>
			</request>
			<thinktime />		
			<request>
				<http url="/ztgc" method="POST" version="1.1"></http>
			</request>
			<thinktime />	
			<for from="1" to="2" incr="1" var="counter">
				<request>
					<http url="/dxgc" method="POST" version="1.1"></http>
				</request>
				<thinktime />	
				<for from="1" to="2" incr="1" var="counter">
					<request>
						<http url="/dwgc" method="POST" version="1.1"></http>
					</request>
					<thinktime />	
					<for from="1" to="5" incr="1" var="counter">
						<request>
							<http url="/fbfx" method="POST" version="1.1"></http>
						</request>
						<thinktime />	
						<for from="1" to="10" incr="1" var="counter">
							<request>
								<http url="/qd" method="POST" version="1.1"></http>
							</request>
							<thinktime />	
							<for from="1" to="5" incr="1" var="counter">
								<request>
									<http url="/de" method="POST" version="1.1"></http>
								</request>
								<thinktime />	
								<for from="1" to="5" incr="1" var="counter">
									<request>
										<http url="/glj" method="POST" version="1.1"></http>
									</request>
									<thinktime />	
								</for>
							</for>
						</for>
					</for>
				</for>
			</for>
		</session>
	</sessions>
</tsung>